nguyentri/da-pac/svd/DA14682.svd
	<registers>
	<register>
	<name>CHARGER_CTRL1_REG</name>
	<description>Charger control register 1</description>
	<addressOffset>0x00000008</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00002000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>DIE_TEMP_DISABLE</name>
	<description>0: Die temperature protection enabled: charger will be disabled when die temp exceeds value set in DIE_TEMP_SET
1: Die temperature protection disabled: testmode, use only in agreement with Dialog</description>
	<bitRange>[14:14]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIE_TEMP_SET</name>
	<description>Die temperature protection level.
Charging will be automatically disabled if set level is exceeded and resumed when temperature has dropped few degrees below set level.
00: 0oC (do not use, for test only)
01: 50oC (do not use, for test only)
10: 80oC (default)
11: 100oC</description>
	<bitRange>[13:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CHARGE_CUR</name>
	<description>Constant Current levels (typical values)
0000: 5 mA
0001: 10 mA
0010: 30 mA
0011: 45 mA
0100: 60 mA
0101: 90 mA
0110: 120 mA
0111: 150 mA
1000: 180 mA
1001: 210 mA
1010: 270 mA
1011: 300 mA
1100: 350 mA
1101: 400 mA </description>
	<bitRange>[11:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>NTC_LOW_DISABLE</name>
	<description>0: Normal operation: voltage level higher than 7/8 VDD_USB will disable the charger
1: NTC low temp limit disabled: use if trickle charging below the minimum temperature is required </description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>NTC_DISABLE</name>
	<description>0: Charger NTC protection enabled
1: Charger NTC protection disable</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CHARGE_ON</name>
	<description>0: Charger in powerdown
1: Charger enabled </description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CHARGE_LEVEL</name>
	<description>Constant Voltage Levels
00000: 3.00V (reset)
00001: 3.40V (e.g. 2xNiMH)
00010: 3.50V
00011: 3.60V (e.g. Li-phosphate)
00100: 3.74V
00101: 3.86V
00110: 4.00V
00111: 4.05V
01000: 4.10V
01001: 4.15V
01010: 4.20V (e.g. Li-Co, Li-Mn, NMC)
01011: 4.25V
01100: 4.30V
01101: 4.35V
01110: 4.40V
01111: 4.50V
10000: 4.60V
10001: 4.90V e.g. 3xNiMH
10010: 5.00V</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>CHARGER_CTRL2_REG</name>
	<description>Charger control register 2</description>
	<addressOffset>0x0000000a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000f07</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>CHARGER_TEST</name>
	<description>Signals are mapped on SPDIF pin.
Also set ANA_TEST_REG[ANA_TESTBUS_TO_ADCPIN] = 1

000: normal mode (no test selected)
001: Vptat (temperature sensor) [1.4V max]
010: Vbat_sense after divider [1.2V]
011: Current loop output [0 to vsupply]
100: Voltage loop output [0 to vsupply]
101: Imeas or Iref/10
110: Icharge reduced by 26.6
111: reserved</description>
	<bitRange>[15:13]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CURRENT_OFFSET_TRIM</name>
	<description>do not change, for test purpose only</description>
	<bitRange>[12:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CHARGER_VFLOAT_ADJ</name>
	<description>Independent adjustment for the charge level. Adjust range is +/- 1.8 percent. The 4 bits adjustment is in two's complement.</description>
	<bitRange>[7:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CURRENT_GAIN_TRIM</name>
	<description>do not change, for test purpose only</description>
	<bitRange>[3:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>CHARGER_STATUS_REG</name>
	<description>Charger status and trimming register</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ff7f</resetMask>
	<fields><field>
	<name>CHARGER_TMODE_PROT</name>
	<description>0: Dietemp below DIE_TEMP_SET level. Normal operation
1: Dietemp above DIE_TEMP_SET level. Charging is disabled</description>
	<bitRange>[6:6]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CHARGER_BATTEMP_HIGH</name>
	<description>0: Battery pack temperature 'ok' or 'too low' (voltage level on NTC pin above 1/2 VDD_USB)
1: Battery pack temperature 'too high' (voltage level on NTC pin below 1/2 VDD_USB)</description>
	<bitRange>[5:5]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CHARGER_BATTEMP_OK</name>
	<description>0: Battery pack temperature 'too low' or 'too high' (voltage level on NTC pin below 1/2 or above 7/8 VDD_USB)
1: Battery pack temperature 'ok' (voltage level on NTC pin between 1/2 and 7/8 VDD_USB)</description>
	<bitRange>[4:4]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CHARGER_BATTEMP_LOW</name>
	<description>0: Battery pack temperature 'ok' or 'too high' (voltage level on NTC pin below 7/8 VDD_USB)
1: Battery pack temperature 'too low' (voltage level on NTC pin above than 7/8 VDD_USB)</description>
	<bitRange>[3:3]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>END_OF_CHARGE</name>
	<description>0: Actual charge current is between 10...100 percent of set CHARGE_CUR (or CHARGE_ON=0)
1: Actual charge current &lt;10 percent of set CHARGE_CUR</description>
	<bitRange>[2:2]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CHARGER_CV_MODE</name>
	<description>0: voltage loop not in regulation (or charger is off)
1: constant voltage mode active, voltage loop in regulation. </description>
	<bitRange>[1:1]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CHARGER_CC_MODE</name>
	<description>0: current loop not in regulation (or charger is off)
1: constant current mode active, current loop in regulation. </description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>CLK_REF_CNT_REG</name>
	<description>Count value for oscillator calibration</description>
	<addressOffset>0x00000062</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>REF_CNT_VAL</name>
	<description>Indicates the calibration time, with a decrement counter to 1. </description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>CLK_REF_SEL_REG</name>
	<description>Select clock for oscillator calibration</description>
	<addressOffset>0x00000060</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>REF_CAL_START</name>
	<description>Writing a '1' starts a calibration. This bit is cleared when calibration is finished, and CLK_REF_VAL is ready. </description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>REF_CLK_SEL</name>
	<description>Select clock input for calibration:
0x0 : RC32K oscillator
0x1 : RC16M oscillator
0x2 : XTAL32K oscillator
0x3 : RCX oscillator</description>
	<bitRange>[1:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>CLK_REF_VAL_H_REG</name>
	<description>DIVN reference cycles, upper 16 bits</description>
	<addressOffset>0x00000066</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>XTAL_CNT_VAL</name>
	<description>Returns the upper 16 bits of DIVN clock cycles counted during the calibration time, defined with REF_CNT_VAL </description>
	<bitRange>[15:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>CLK_REF_VAL_L_REG</name>
	<description>DIVN reference cycles, lower 16 bits</description>
	<addressOffset>0x00000064</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>XTAL_CNT_VAL</name>
	<description>Returns the lower 16 bits of DIVN clock cycles counted during the calibration time, defined with REF_CNT_VAL </description>
	<bitRange>[15:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>SOC_ADD2CH_REG</name>
	<description>Fuel Gauge manually add extra charge to SOC_CHARGE_CNTRx_REG</description>
	<addressOffset>0x00000046</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>SOC_ADD2CH</name>
	<description>Extra charge to be added to the SOC_CHARGE_CNTRx_REG per sample period (9-bit + sign + 6 fractional bits </description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>SOC_CHARGE_AVG_REG</name>
	<description>Fuel Gauge Average charge counter</description>
	<addressOffset>0x00000050</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>CHARGE_AVG</name>
	<description>Average of 'charge' current (9-bit + sign and 6 fractional bits </description>
	<bitRange>[15:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>SOC_CHARGE_CNTR1_REG</name>
	<description>Fuel Gauge Charge counter bits 15-0</description>
	<addressOffset>0x00000048</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>CHARGE_CNT1</name>
	<description>Sum of the charge-values per sampling period; (bits15:0)
The absolute full-scale charge value is 6-bits, At full scale charge current it takes 2^26 sampling periods until overflow of the charge_cnt register after a reset_charge event.
At fs=144kHz (=default) this will happen after 33 hours
At fs=1.152MHz After 10 hours </description>
	<bitRange>[15:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>SOC_CHARGE_CNTR2_REG</name>
	<description>Fuel Gauge Charge counter bits 31-16</description>
	<addressOffset>0x0000004a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>CHARGE_CNT2</name>
	<description>Sum of the charge-values per sampling period; (bits23:16) </description>
	<bitRange>[15:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>SOC_CHARGE_CNTR3_REG</name>
	<description>Fuel Gauge Charge counter bits 39-32</description>
	<addressOffset>0x0000004c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>CHARGE_CNT3</name>
	<description>Sum of the charge-values per sampling period; (bits39:24) </description>
	<bitRange>[7:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>SOC_CTRL1_REG</name>
	<description>Fuel Gauge Control register 1</description>
	<addressOffset>0x00000040</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x0000d880</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>SOC_CINT</name>
	<description>Integrator capacitor scaler
0: Cint = 1 pF
1: Cint = 2 pF
2: Cint = 4 pF
3: Cint = 8 pF (=default) </description>
	<bitRange>[15:14]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SOC_BIAS</name>
	<description>Current DAC scaler
0: Ibias = 2 uA
1: Ibias = 1 uA (=default)
2: Ibias = 0.5 uA
3: Ibias = 0.25 uA </description>
	<bitRange>[13:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SOC_CLK</name>
	<description>SOC Sample frequency
0: automatic mode (tbd)
1: fs = 18 kHz
2: fs = 36 kHz
3: fs = 72 kHz
4: fs = 144 kHz (=default)
5: fs = 288 kHz
6: fs = 576 kHz
7: fs = 1152 kHz </description>
	<bitRange>[11:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SOC_LPF</name>
	<description>0: low-pass filter at integrator inputs disabled
1: Enables a low-pass filter at the integrator inputs </description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SOC_IDAC</name>
	<description>Scales the current DAC (Ibias: default=1uA)
0: Idac=0.25*Ibias
1: Idac=0.5*Ibias
2: Idac=Ibias (=default)
3: Idac=2*Ibias</description>
	<bitRange>[7:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SOC_SIGN</name>
	<description>Defines the sign of the charge converter input and output to perform a chopper function to eliminate offset voltage (see also SOC_CHOP and 'sign' on output pin)
0: non-inverted inputs and outputs
1: inverted inputs and outputs</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SOC_GPIO</name>
	<description>Reserved (not yet implemented): switches the SOC-inputs to the GPIO pins</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SOC_MUTE</name>
	<description>0: Normal operation
1: Connect the input voltage to 0V </description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SOC_RESET_AVG</name>
	<description>1: Reset the SOC_CHARGE_AVG_REG to the last value of SOC_CHARGE_CNTRx_REG </description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SOC_RESET_CHARGE</name>
	<description>1: Reset CHARGE_CNTR_REG </description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SOC_ENABLE</name>
	<description>0: SOC analog circuits off. CHARGE_CNTRx_REG can still be written for a manual update.
See SOC_ADD2CH_REG
1: SOC analog circuits enabled </description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>SOC_CTRL2_REG</name>
	<description>Fuel Gauge Control register 2</description>
	<addressOffset>0x00000042</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x0000776a</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>SOC_DYNAVG</name>
	<description>if HIGH then 'weight' of Moving Average is forced to 1 if the converter detects significant input change
(if dcharge &gt; 4*delta_c, or high_limit, or low_limit) </description>
	<bitRange>[15:15]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SOC_MAW</name>
	<description>Moving Average Weight factor
charge_avg(n) =
(weight*charge_avg(n-1) + charge(n) ) / (weight+1) where:weight = 2^(soc_maw) </description>
	<bitRange>[14:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SOC_CMIREG_ENABLE</name>
	<description>SOC_CMIREG enable</description>
	<bitRange>[11:11]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SOC_CHOP</name>
	<description>Chopping control
0: 'external' chopping control with 'soc_sign'-input
1: chop each 2^1*scycle fs-periods
2: chop each 2^2*scycle fs-periods
..
7: chop each 2^7*scycle fs-periods. </description>
	<bitRange>[10:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SOC_ICM</name>
	<description>adds a common-mode current to Idac to increase the common-mode input-level of the integrator.
The common-mode input level is equal to (Idac+Icm)*Rvi;
0: Icm=0;
1: Icm=1*Ibias (=default);
2: Icm=2*Ibias;
3: Icm=4*Ibias</description>
	<bitRange>[7:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SOC_DCYCLE</name>
	<description>Cycle the current divider segments of Idac
0: no cycling
1: cycle each scycle fs-periods </description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SOC_SCYCLE</name>
	<description>Cycle current segments (8 segments) of Idac
0: no cycling
1: cycle each fs-period
2: cycle each 2 fs-periods
..
7: cycle each 7 fs-periods </description>
	<bitRange>[4:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SOC_RVI</name>
	<description>Voltage-to-current resistor scaler
0: Rvi = 25 k
1: Rvi = 50 k
2: Rvi = 100 k (= default)
3: Rvi = 200 k </description>
	<bitRange>[1:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>SOC_CTRL3_REG</name>
	<description>Fuel Gauge Control register 3</description>
	<addressOffset>0x00000044</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000011</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>SOC_VCMI</name>
	<description>Common Input Voltage target of regulator (see SOC_CMIREG_ENABLE)
0: 50 mV
1: 100 mV
2: 150 mV
3: 200 mV</description>
	<bitRange>[5:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SOC_DYNHYS</name>
	<description>Reserved. (To be implemented)
Hysteresis of the comparator which detects if the integrator voltage is rising or falling </description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SOC_DYNTARG</name>
	<description>Reserved. (To be implemented)
0: Vint_target = 0V
1: Vint_target tracks the 2 MSB's of the charge register) </description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SOC_VSAT</name>
	<description>Trigger level of the high-limit and low-limit comparators.
0: low_limit = -50mV; high_limit = +50mV
1: low_limit = -100mV; high_limit = +100mV (=default)
2: low_limit = -200mV; high_limit = +200mV
3: low_limit = -400mV; high_limit = +400mV</description>
	<bitRange>[1:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>SOC_EXT_IN_REG</name>
	<description>Fuel Gauge input test register</description>
	<addressOffset>0x00000054</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>SOC_EXT_IDAC_EN</name>
	<description>1: Enable 'external' control of Idac</description>
	<bitRange>[15:15]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SOC_EXT_SCYCLE_EN</name>
	<description>1: Enable 'external' control of scycle</description>
	<bitRange>[14:14]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SOC_NR_SCYCLE</name>
	<description>Number of the scycle </description>
	<bitRange>[13:11]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SOC_RDAC_DIS</name>
	<description>0: Disables the resistor divider DAC. The Idac has 6-bits (plus sign)
1: Enables the resistor divider DAC. The Idac has 9-bits (plus sign)</description>
	<bitRange>[10:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SOC_IDAC_SIGN</name>
	<description>0: SOC_IDAC_VAL is positive
1: SOC_IDAC_VAL is negative</description>
	<bitRange>[9:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SOC_IDAC_VAL</name>
	<description>Controls the current for the DAC.
0: 0/512*SOC_IDAC
N: N/512*SOC_IDAC</description>
	<bitRange>[8:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>SOC_EXT_OUT_REG</name>
	<description>Fuel Gauge output test register</description>
	<addressOffset>0x00000056</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>SOC_CTRL_EVENT</name>
	<description>Controller event </description>
	<bitRange>[8:8]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>SOC_STATE</name>
	<description>Controller state </description>
	<bitRange>[7:4]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>SOC_RISING_COMP</name>
	<description>Rising comparator output </description>
	<bitRange>[3:3]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>SOC_POS_COMP</name>
	<description>Positive comparator output </description>
	<bitRange>[2:2]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>SOC_LOWLIM_COMP</name>
	<description>Low_limit comparator output </description>
	<bitRange>[1:1]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>SOC_HIGH_LIM</name>
	<description>High_limit comparator output </description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>SOC_STATUS_REG</name>
	<description>Fuel Gauge Status register</description>
	<addressOffset>0x00000052</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>SOC_INT_LOCKED</name>
	<description>0: Normal Operation
1: Integrator is pushed over high or low limit.
Returns to '0' if the converter runs for more than 2 sequential sampling periods in a 'safe' region (dcharge &lt; 2*delta_c) </description>
	<bitRange>[1:1]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>SOC_INT_OVERLOAD</name>
	<description>0: Normal Operation
1: Integrator exceeds high or low limit with full-scale IDAC (charge) for more than 3 sequential sampling periods </description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>APU</name>
	<version>1.0</version>
	<description>APU registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50004000</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>276</size>
	<usage>registers</usage>
</addressBlock>
	
