nguyentri/da-pac/svd/DA14682.svd
	<registers>
	<register>
	<name>CHIP_ID1_REG</name>
	<description>Chip identification register 1.</description>
	<addressOffset>0x00000000</addressOffset>
	<size>8</size>
	<access>read-write</access>
	<resetValue>0x00000036</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields><field>
	<name>CHIP_ID1</name>
	<description>First character of device type &quot;680&quot; in ASCII. </description>
	<bitRange>[7:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>CHIP_ID2_REG</name>
	<description>Chip identification register 2.</description>
	<addressOffset>0x00000001</addressOffset>
	<size>8</size>
	<access>read-write</access>
	<resetValue>0x00000038</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields><field>
	<name>CHIP_ID2</name>
	<description>Second character of device type &quot;680&quot; in ASCII. </description>
	<bitRange>[7:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>CHIP_ID3_REG</name>
	<description>Chip identification register 3.</description>
	<addressOffset>0x00000002</addressOffset>
	<size>8</size>
	<access>read-write</access>
	<resetValue>0x00000030</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields><field>
	<name>CHIP_ID3</name>
	<description>Third character of device type &quot;680&quot; in ASCII. </description>
	<bitRange>[7:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>CHIP_REVISION_REG</name>
	<description>Chip revision register.</description>
	<addressOffset>0x00000004</addressOffset>
	<size>8</size>
	<access>read-write</access>
	<resetValue>0x00000042</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields><field>
	<name>REVISION_ID</name>
	<description>Chip version, corresponds with type number in ASCII.
0x41 = 'A', 0x42 = 'B' </description>
	<bitRange>[7:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>CHIP_SWC_REG</name>
	<description>Software compatibility register.</description>
	<addressOffset>0x00000003</addressOffset>
	<size>8</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields><field>
	<name>CHIP_SWC</name>
	<description>SoftWare Compatibility code.
Integer (default = 0) which is incremented if a silicon change has impact on the CPU Firmware.
Can be used by software developers to write silicon revision dependent code. </description>
	<bitRange>[3:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>COEX</name>
	<version>1.0</version>
	<description>COEX registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50002f00</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>48</size>
	<usage>registers</usage>
</addressBlock>
	
	<registers>
	<register>
	<name>COEX_BLE_PTI_REG</name>
	<description>COEX BLE PTI Control Register</description>
	<addressOffset>0x0000000a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>COEX_BLE_PTI</name>
	<description>This value specifies the PTI value that characterizes the next BLE transaction that will be initiated on the following &quot;ble_active&quot; positive edge. The value should remain constant during the high period of the &quot;ble_active&quot; signal.</description>
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>COEX_CTRL_REG</name>
	<description>COEX Control Register</description>
	<addressOffset>0x00000000</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>IGNORE_BLE</name>
	<description>If set to &quot;1&quot; then all BLE requests are ignored by masking the internal &quot;ble_active&quot; signal. Refer also to IGNORE_BLE_STAT.</description>
	<bitRange>[15:15]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>IGNORE_FTDF</name>
	<description>If set to &quot;1&quot; then all FTDF requests are ignored by masking the internal &quot;ftdf_active&quot; signal. Refer also to IGNORE_FTDF_STAT.</description>
	<bitRange>[14:14]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>IGNORE_EXT</name>
	<description>If set to &quot;1&quot; then all EXT requests are ignored by masking the internal &quot;ext_act&quot; signal (&quot;ext_act&quot; is the logical OR of &quot;ext_act0&quot; and &quot;ext_act1&quot;). Refer also to IGNORE_EXT_STAT.</description>
	<bitRange>[13:13]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SEL_BLE_RADIO_BUSY</name>
	<description>Select the logic driving the BLE core input &quot;ble.radio_busy&quot;:
0: (decision==BLE) AND rfcu.radio_busy.
1: Hold to &quot;0&quot;.
2: (decision==FTDF) OR (decision==EXT) OR rfcu.radio_busy.
3: (decision==FTDF) OR (decision==EXT).
Selection &quot;0&quot; is the default, while selection &quot;2&quot; is the recommended value if the BLE SW supports it.</description>
	<bitRange>[12:11]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SEL_BLE_WLAN_TX_RX</name>
	<description>If set to &quot;1&quot; then the COEX block will drive the WLAN_TX and WLAN_RX inputs of the BLE core. Otherwise both BLE inputs will be forced to &quot;0&quot;.</description>
	<bitRange>[10:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SEL_BLE_PTI</name>
	<description>It controls the source of the BLE PTI value that the COEX Arbiter will use.
If &quot;0&quot; then use the COEX_BLE_PTI_REG.
If &quot;1&quot; then use the PTI value provided by the BLE core.</description>
	<bitRange>[9:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SEL_FTDF_PTI</name>
	<description>It controls the source of the FTDF PTI value that the COEX Arbiter will use.
If &quot;0&quot; then use the COEX_FTDF_PTI_REG.
If &quot;1&quot; then use the PTI value provided by the FTDF core.</description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SEL_FTDF_CCA</name>
	<description>If set to &quot;1&quot; and the COEX decision is different than &quot;FTDF&quot;, then the CCA_STAT signal going to FTDF (generated from the radio) will be forced to &quot;1&quot;; otherwise the FTDF.CCA_STAT will be driven with the signal generated from the radio.
Recommended value for SEL_FTDF_CCA is &quot;1&quot;.</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SEL_COEX_DIAG</name>
	<description>The COEX block can provide internal diagnostic signals by overwriting the BLE diagnostic bus, which is forwarded to GPIO multiplexing. There is no need to program the BLE registers, but only this field and the GPIO PID fields.
0: No COEX diagnostics, only BLE.
1: BLE_DIAG[4:3]=decision[1:0]; BLE_DIAG[5]=closing.
2: BLE_DIAG[4:3]=decision[1:0]; BLE_DIAG[5]=closing; BLE_DIAG[6]=OR( ftdf/ble2coex_tx/rx_en )
3: BLE_DIAG[2]=closing OR radio_busy; BLE_DIAG[6:3]=decision_ptr[3:0]; BLE_DIAG[7]=0.</description>
	<bitRange>[6:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SMART_ACT_IMPL</name>
	<description>Controls the behavior of the SMART_ACT (and SMART_PRI as a consequence).
If SMART_ACT_IMPL=&quot;0&quot; then if any BLE or FTDF MAC request is active then SMART_ACT will be asserted. SMART_ACT will actually be the logical OR of &quot;ble_active&quot; and &quot;ftdf_active&quot; internal signals. SMART_ACT will be asserted regardless the decision of the Arbiter to allow or disallow the access to the on-chip radio from the active MAC(s).
if SMART_ACT_IMPL=&quot;1&quot; then if the Arbiter's decision is to allow EXTernal MAC, then keep SMART_ACT to &quot;0&quot;, otherwise follow the implementation of SMART_ACT_IMPL=&quot;0&quot;.</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TXRX_MON_BLE_ALL</name>
	<description>It controls the behavior of the Monitoring bitfields COEX_INT_STAT_REG[ *TXRX_MON* ]
If &quot;0&quot; then update the Monitoring bitfields with BLE Rx/Tx that has been masked.
If &quot;1&quot; then update for every BLE Rx/Tx, either masked or not.</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TXRX_MON_FTDF_ALL</name>
	<description>It controls the behavior of the Monitoring bitfields COEX_INT_STAT_REG[ *TXRX_MON* ]
If &quot;0&quot; then update the Monitoring bitfields with FTDF Rx/Tx that has been masked.
If &quot;1&quot; then update for every FTDF Rx/Tx, either masked or not.</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DECISION_SW_ALL</name>
	<description>Refer to COEX_INT_STAT_REG[ IRQ_DECISION_SW ] bitfield description.</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PRGING_ARBITER</name>
	<description>If set to &quot;1&quot; then the current transaction (Tx or Rx) will complete normally and after that no further decision will be taken by the arbiter. Will be set to &quot;1&quot; automatically by the HW as soon as a write operation will be detected to the COEX_PRIx_REG registers. As soon as the update on the priorities will be completed, the SW should clear this bit. The SW can set or clear this bit.
Note: Depending on the relationship between the PCLK and COEX_CLK periods a write operation to this bitfield may be effective in more than one PCLK clock cycles.</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>COEX_FTDF_PTI_REG</name>
	<description>COEX FTDF PTI Control Register</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>COEX_FTDF_PTI</name>
	<description>This value specifies the PTI value that characterizes the next FTDF transaction that will be initiated on the following &quot;ftdf_active&quot; positive edge. The value should remain constant during the high period of the &quot;ftdf_active&quot; signal. Refer also to bitfield COEX_CTRL_REG.SEL_FTDF_PTI.</description>
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>COEX_INT_MASK_REG</name>
	<description>COEX Interrupt Mask Register</description>
	<addressOffset>0x00000006</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>IRQ_DECISION_SW</name>
	<description>If &quot;1&quot; then a &quot;1&quot; on COEX_INT_STAT_REG[IRQ_DECISION_SW] will generate an IRQ to CPU.</description>
	<bitRange>[9:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>IRQ_TXRX_MON</name>
	<description>If &quot;1&quot; then a &quot;1&quot; on COEX_INT_STAT_REG[IRQ_TXRX_MON] will generate an IRQ to CPU.</description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>COEX_INT_STAT_REG</name>
	<description>COEX Interrupt Status Register</description>
	<addressOffset>0x00000008</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>IRQ_DECISION_SW</name>
	<description>IRQ event when the DECISION switches to another value.
If DECISION_SW_ALL=1, then it reports any change of DECISION value.
If DECISION_SW_ALL=0, then it reports only the switches to another MAC, ignoring also the intermediate transitions to DECISION==NONE.
For example the sequence FTDF-NONE-FTDF-NONE-BLE-NONE-BLE will report only the first switch from NONE to BLE.
Note that after a Radio Power domain reset, the first transition of the DECISION to any non-NONE value will also trigger this event.</description>
	<bitRange>[9:9]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>IRQ_TXRX_MON</name>
	<description>Tx/Rx Monitor event pending. When this bitfield is set, then there is a valid entry at the bitfields TXRX_MON_PTR, TXRX_MON_TX, TXRX_MON_PASSED and TXRX_MON_OVWR. </description>
	<bitRange>[8:8]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>TXRX_MON_OVWR</name>
	<description>Tx/Rx Monitor entry Overwritten.
if &quot;1&quot; then TXRX_MON_PTR loaded a new value without being cleared first by the software. Provides an indication that the software does not fetch the TXRX_MON_PTR fast enough.</description>
	<bitRange>[7:7]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>TXRX_MON_PASSED</name>
	<description>This bit indicates if the corresponding TXRX_MON_PTR pointer indicates a Tx/Rx that has been masked or not by the COEX block.
If &quot;0&quot; then the Tx/Rx has been masked.
If &quot;1&quot; then the Tx/Rx has not been masked.
The bitfield is valid only when TXRX_MON_PTR is not zero.</description>
	<bitRange>[6:6]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>TXRX_MON_TX</name>
	<description>If &quot;0&quot; then the corresponding TXRX_MON_PTR corresponds to an Rx.
If &quot;1&quot; then the corresponding TXRX_MON_PTR corresponds to an Tx.
The bitfield is valid only when TXRX_MON_PTR is not zero.</description>
	<bitRange>[5:5]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>TXRX_MON_PTR</name>
	<description>Tx/Rx Monitor Pointer.
If not zero then it provides a pointer to the Priority registers indicating the completion of an Tx or Rx (deassertion of TX_EN or RX_EN) that corresponds to this Priority register. Refer also to the COEX_CTRL_REG[ TXRX_MON_ALL ] control bit.
If the PTI that corresponds to the deasserted TX_EN/RX_EN is not in the Priority Register list, then this event will be ignored and will not be reported by the TXRX Monitoring bitfields.
Reading the register will clear the bitfield.</description>
	<bitRange>[3:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>COEX_PRI10_REG</name>
	<description>COEX Priority Register</description>
	<addressOffset>0x00000024</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>COEX_PRI_MAC</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<bitRange>[4:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>COEX_PRI_PTI</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>COEX_PRI11_REG</name>
	<description>COEX Priority Register</description>
	<addressOffset>0x00000026</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>COEX_PRI_MAC</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<bitRange>[4:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>COEX_PRI_PTI</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>COEX_PRI12_REG</name>
	<description>COEX Priority Register</description>
	<addressOffset>0x00000028</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>COEX_PRI_MAC</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<bitRange>[4:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>COEX_PRI_PTI</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>COEX_PRI13_REG</name>
	<description>COEX Priority Register</description>
	<addressOffset>0x0000002a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>COEX_PRI_MAC</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<bitRange>[4:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>COEX_PRI_PTI</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>COEX_PRI14_REG</name>
	<description>COEX Priority Register</description>
	<addressOffset>0x0000002c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>COEX_PRI_MAC</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<bitRange>[4:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>COEX_PRI_PTI</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>COEX_PRI15_REG</name>
	<description>COEX Priority Register</description>
	<addressOffset>0x0000002e</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>COEX_PRI_MAC</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<bitRange>[4:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>COEX_PRI_PTI</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>COEX_PRI1_REG</name>
	<description>COEX Priority Register</description>
	<addressOffset>0x00000012</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000018</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>COEX_PRI_MAC</name>
	<description>Specifies the MAC that has been assigned with the specific priority level. The MAC encoding follows the COEX_DECISION bitfield encoding.</description>
	<bitRange>[4:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>COEX_PRI_PTI</name>
	<description>The priority level specified by the name of this register will be applied to the packets coming from the MAC specified by the COEX_PRI_MAC bitfield and characterized with the PTI value specified by the COEX_PRI_PTI bitfield.
The effective PTI value of the packets coming from BLE and FTDF is controlled by the register bitfields SEL_BLE_PTI and SEL_FTDF_PTI, while for the External MAC (EXT) the PTI is considered always as &quot;0&quot;.</description>
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>COEX_PRI2_REG</name>
	<description>COEX Priority Register</description>
	<addressOffset>0x00000014</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000008</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>COEX_PRI_MAC</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<bitRange>[4:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>COEX_PRI_PTI</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>COEX_PRI3_REG</name>
	<description>COEX Priority Register</description>
	<addressOffset>0x00000016</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000010</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>COEX_PRI_MAC</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<bitRange>[4:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>COEX_PRI_PTI</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>COEX_PRI4_REG</name>
	<description>COEX Priority Register</description>
	<addressOffset>0x00000018</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>COEX_PRI_MAC</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<bitRange>[4:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>COEX_PRI_PTI</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>COEX_PRI5_REG</name>
	<description>COEX Priority Register</description>
	<addressOffset>0x0000001a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>COEX_PRI_MAC</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<bitRange>[4:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>COEX_PRI_PTI</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>COEX_PRI6_REG</name>
	<description>COEX Priority Register</description>
	<addressOffset>0x0000001c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>COEX_PRI_MAC</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<bitRange>[4:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>COEX_PRI_PTI</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>COEX_PRI7_REG</name>
	<description>COEX Priority Register</description>
	<addressOffset>0x0000001e</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>COEX_PRI_MAC</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<bitRange>[4:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>COEX_PRI_PTI</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>COEX_PRI8_REG</name>
	<description>COEX Priority Register</description>
	<addressOffset>0x00000020</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>COEX_PRI_MAC</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<bitRange>[4:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>COEX_PRI_PTI</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>COEX_PRI9_REG</name>
	<description>COEX Priority Register</description>
	<addressOffset>0x00000022</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>COEX_PRI_MAC</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<bitRange>[4:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>COEX_PRI_PTI</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>COEX_STAT2_REG</name>
	<description>COEX Status 2 Register</description>
	<addressOffset>0x00000004</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>COEX_EXT_ACT</name>
	<description>The internal EXT_ACT used for the decision taking. </description>
	<bitRange>[15:15]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>COEX_BLE_PTI_INT</name>
	<description>The BLE PTI value that is used for decision taking.</description>
