nguyentri/da-pac/svd/DA14682.svd
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00003fff</resetMask>
	<fields><field>
	<name>DCDC_P_COMP_MAN_TRIM</name>
	<description>Trim mode for P side comparator
0 = Automatic
1 = Manual</description>
	<bitRange>[13:13]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_P_COMP_TRIM</name>
	<description>Manual trim value for P side comparator
Signed magnitude representation
011111 = +47 mV
000000 = 100000 = +16 mV
111111 = -15 mV</description>
	<bitRange>[12:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_N_COMP_MAN_TRIM</name>
	<description>Trim mode for N side comparator
0 = Automatic
1 = Manual</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_N_COMP_TRIM</name>
	<description>Manual trim value for N side comparator
Signed magnitude representation
011111 = +13 mV
000000 = 100000 = -22 mV
111111 = -56 mV</description>
	<bitRange>[5:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DCDC_V14_0_REG</name>
	<description>DCDC V14 First Control Register</description>
	<addressOffset>0x00000008</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x0000a1a4</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>DCDC_V14_FAST_RAMPING</name>
	<description>V14 output fast current ramping (improves response time at the cost of more ripple)</description>
	<bitRange>[15:15]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_V14_VOLTAGE</name>
	<description>V14 output voltage
V = 1.2 V + 25 mV * N</description>
	<bitRange>[14:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_V14_CUR_LIM_MAX_HV</name>
	<description>V14 output maximum current limit (high battery voltage mode)
I = 30 mA * (1 + N)</description>
	<bitRange>[9:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_V14_CUR_LIM_MIN</name>
	<description>V14 output minimum current limit
I = 30 mA * (1 + N)</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DCDC_V14_1_REG</name>
	<description>DCDC V14 Second Control Register</description>
	<addressOffset>0x0000000a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x0000d890</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>DCDC_V14_ENABLE_HV</name>
	<description>V14 output enable (high battery voltage mode)
0 = Disabled
1 = Enabled</description>
	<bitRange>[15:15]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_V14_ENABLE_LV</name>
	<description>V14 output enable (low battery voltage mode)
0 = Disabled
1 = Enabled</description>
	<bitRange>[14:14]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_V14_CUR_LIM_MAX_LV</name>
	<description>V14 output maximum current limit low battery voltage mode)
I = 30 mA * (1 + N)</description>
	<bitRange>[13:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_V14_IDLE_HYST</name>
	<description>V14 output idle time hysteresis
0 - 3875 ns, 125 ns step size
IDLE_MAX = IDLE_MIN + IDLE_HYST
Maximum idle time before decreasing CUR_LIM</description>
	<bitRange>[9:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_V14_IDLE_MIN</name>
	<description>V14 output minimum idle time
0 - 3875 ns, 125 ns step size
Minimum idle time, CUR_LIM is increased if this limit is not reached</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DCDC_V18P_0_REG</name>
	<description>DCDC VPA First Control Register</description>
	<addressOffset>0x00000014</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x0000e3e4</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>DCDC_V18P_FAST_RAMPING</name>
	<description>V18P output fast current ramping (improves response time at the cost of more ripple)</description>
	<bitRange>[15:15]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_V18P_VOLTAGE</name>
	<description>V18P output voltage
V = 1.2 V + 25 mV * N</description>
	<bitRange>[14:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_V18P_CUR_LIM_MAX_HV</name>
	<description>V18P output maximum current limit (high battery voltage mode)
I = 30 mA * (1 + N)</description>
	<bitRange>[9:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_V18P_CUR_LIM_MIN</name>
	<description>V18P output minimum current limit
I = 30 mA * (1 + N)</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DCDC_V18P_1_REG</name>
	<description>DCDC VPA Second Control Register</description>
	<addressOffset>0x00000016</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x0000bc90</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>DCDC_V18P_ENABLE_HV</name>
	<description>V18P output enable (high battery voltage mode)
0 = Disabled
1 = Enabled</description>
	<bitRange>[15:15]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_V18P_ENABLE_LV</name>
	<description>V18P output enable (low battery voltage mode)
0 = Disabled
1 = Enabled</description>
	<bitRange>[14:14]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_V18P_CUR_LIM_MAX_LV</name>
	<description>V18P output maximum current limit low battery voltage mode)
I = 30 mA * (1 + N)</description>
	<bitRange>[13:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_V18P_IDLE_HYST</name>
	<description>V18P output idle time hysteresis
0 - 3875 ns, 125 ns step size
IDLE_MAX = IDLE_MIN + IDLE_HYST
Maximum idle time before decreasing CUR_LIM</description>
	<bitRange>[9:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_V18P_IDLE_MIN</name>
	<description>V18P output minimum idle time
0 - 3875 ns, 125 ns step size
Minimum idle time, CUR_LIM is increased if this limit is not reached</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DCDC_V18_0_REG</name>
	<description>DCDC V18 First Control Register</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x0000e3e4</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>DCDC_V18_FAST_RAMPING</name>
	<description>V18 output fast current ramping (improves response time at the cost of more ripple)</description>
	<bitRange>[15:15]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_V18_VOLTAGE</name>
	<description>V18 output voltage
V = 1.2 V + 25 mV * N</description>
	<bitRange>[14:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_V18_CUR_LIM_MAX_HV</name>
	<description>V18 output maximum current limit (high battery voltage mode)
I = 30 mA * (1 + N)</description>
	<bitRange>[9:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_V18_CUR_LIM_MIN</name>
	<description>V18 output minimum current limit
I = 30 mA * (1 + N)</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DCDC_V18_1_REG</name>
	<description>DCDC V18 Second Control Register</description>
	<addressOffset>0x0000000e</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x0000bc90</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>DCDC_V18_ENABLE_HV</name>
	<description>V18 output enable (high battery voltage mode)
0 = Disabled
1 = Enabled</description>
	<bitRange>[15:15]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_V18_ENABLE_LV</name>
	<description>V18 output enable (low battery voltage mode)
0 = Disabled
1 = Enabled</description>
	<bitRange>[14:14]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_V18_CUR_LIM_MAX_LV</name>
	<description>V18 output maximum current limit low battery voltage mode)
I = 30 mA * (1 + N)</description>
	<bitRange>[13:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_V18_IDLE_HYST</name>
	<description>V18 output idle time hysteresis
0 - 3875 ns, 125 ns step size
IDLE_MAX = IDLE_MIN + IDLE_HYST
Maximum idle time before decreasing CUR_LIM</description>
	<bitRange>[9:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_V18_IDLE_MIN</name>
	<description>V18 output minimum idle time
0 - 3875 ns, 125 ns step size
Minimum idle time, CUR_LIM is increased if this limit is not reached</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DCDC_VDD_0_REG</name>
	<description>DCDC VDD First Control Register</description>
	<addressOffset>0x00000010</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x0000c304</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>DCDC_VDD_FAST_RAMPING</name>
	<description>VDD output fast current ramping (improves response time at the cost of more ripple)</description>
	<bitRange>[15:15]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_VDD_VOLTAGE</name>
	<description>VDD output voltage
V = 0.8 V + 25 mV * N</description>
	<bitRange>[14:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_VDD_CUR_LIM_MAX_HV</name>
	<description>VDD output maximum current limit (high battery voltage mode)
I = 30 mA * (1 + N)</description>
	<bitRange>[9:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_VDD_CUR_LIM_MIN</name>
	<description>VDD output minimum current limit
I = 30 mA * (1 + N)</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DCDC_VDD_1_REG</name>
	<description>DCDC VDD Second Control Register</description>
	<addressOffset>0x00000012</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x0000ec90</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>DCDC_VDD_ENABLE_HV</name>
	<description>VDD output enable (high battery voltage mode)
0 = Disabled
1 = Enabled</description>
	<bitRange>[15:15]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_VDD_ENABLE_LV</name>
	<description>VDD output enable (low battery voltage mode)
0 = Disabled
1 = Enabled</description>
	<bitRange>[14:14]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_VDD_CUR_LIM_MAX_LV</name>
	<description>VDD output maximum current limit low battery voltage mode)
I = 30 mA * (1 + N)</description>
	<bitRange>[13:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_VDD_IDLE_HYST</name>
	<description>VDD output idle time hysteresis
0 - 3875 ns, 125 ns step size
IDLE_MAX = IDLE_MIN + IDLE_HYST
Maximum idle time before decreasing CUR_LIM</description>
	<bitRange>[9:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_VDD_IDLE_MIN</name>
	<description>VDD output minimum idle time
0 - 3875 ns, 125 ns step size
Minimum idle time, CUR_LIM is increased if this limit is not reached</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>DEM</name>
	<version>1.0</version>
	<description>DEM registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50002e00</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>90</size>
	<usage>registers</usage>
</addressBlock>
	
