nguyentri/da-pac/svd/DA14682.svd
Primitive ECC &amp; Check Point Operations F(p) &amp; F(2m)
[6:4] = 0x2
[3:0] =
0x0 -&gt; Point Doubling (Projective Coord.)
0x1 -&gt; ptAdd3
0x2 -&gt; GenSessionKey
0x3 -&gt; Check_AB (ECDSA)
0x4 -&gt; Check_n (ECDSA)
0x5 -&gt; Check single value less than N
0x6 -&gt; Check_Point_On_Curve
0x7-&gt; Reserved
0x8 -&gt; Curve25519 point multiplication
0x9 -&gt; Ed25519 Check point on curve
0xA -&gt; Ed25519 ScalarMult
0xB -&gt; Ed25519 CheckValid
others -&gt; Reserved

High-level ECC ECDSA Operations F(p) &amp; F(2m)
[6:4] = 0x3
[3:0] =
0x0 -&gt; ECMQV (part 2)
0x1 -&gt; Verify ZKP
0x2 -&gt; ECDSA Domain Parameters Validation
others -&gt; Reserved


[6:4]=0x4, 0x5, 0x6, 0x7 -&gt; Reserved</description>
	<bitRange>[6:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>ECC_CONFIG_REG</name>
	<description>Configuration register</description>
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x001fffff</resetMask>
	<fields><field>
	<name>ECC_OpPtrC</name>
	<description>When executing primitive arithmetic operations, this pointer defines the location where the result will be stored in Memory.</description>
	<bitRange>[20:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ECC_OpPtrB</name>
	<description>When executing primitive arithmetic operations, this Pointer defines where operand B is located in memory.</description>
	<bitRange>[12:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ECC_OpPtrA</name>
	<description>When executing primitive arithmetic operations, this Pointer defines where operand A is located in memory.</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>ECC_CONTROL_REG</name>
	<description>Control register</description>
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields><field>
	<name>ECC_Start</name>
	<description>The Start signal is activated when all data and key inputs have been loaded in the external crypto memory and are available for processing. This signal is active high and is sampled on the rising edge of Clk.
When this signal goes high, the PK Command present in the PK_CommandReg[] is initiated and executed. The PK_Start signal is ignored when the core is already processing data and is automatically cleared when the operation is finished</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>ECC_STATUS_REG</name>
	<description>Status register</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0001ffff</resetMask>
	<fields><field>
	<name>ECC_Busy</name>
	<description>This Status Signal indicates that the core is processing data. This signal is active high and goes low when the selected algorithm is finished.</description>
	<bitRange>[16:16]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>ECC_PrimalityTestResult</name>
	<description>After the Miller-Rabin Primality test, this flag is:
- set to 0 when the random number under test is probably prime
- cleared to 1 when the random number under test is composite</description>
	<bitRange>[12:12]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>ECC_NotInvertible</name>
	<description>This flag is set to 1 when executing a modular inversion (PK_CommandReg[3:0] = 0x6 or 0x9) if the operand is not invertible.</description>
	<bitRange>[11:11]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>ECC_Param_AB_NotValid</name>
	<description>Status signal set to 1 when parameters A and B are not valid, i.e 4A+ 27B = 0. This flag is updated after execution of the command Check_AB.</description>
	<bitRange>[10:10]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>ECC_Signature_NotValid</name>
	<description>This flag indicates if the signature can be accepted or must be rejected.
This flag is set to 1 when the signature is not valid and is updated after execution of the command ECDSA_Generation, ECDSA_Verification, DSA_Generation, DSA_Verification.</description>
	<bitRange>[9:9]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>ECC_Param_n_NotValid</name>
	<description>Status signal set to 1 when Parameter n is not valid.
This flag is updated after execution of the command Check_n.</description>
	<bitRange>[7:7]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>ECC_Couple_NotValid</name>
	<description>Status signal set to 1 when couple x, y is not valid (i.e. not smaller than the prime).
This flag is updated after execution of the command Check_Couple_Less_Prime.</description>
	<bitRange>[6:6]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>ECC_Point_Px_AtInfinity</name>
	<description>Status signal set to 1 when Point Px is at the infinity.
This flag is updated after execution of an ECC operation.</description>
	<bitRange>[5:5]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>ECC_Point_Px_NotOnCurve</name>
	<description>Status signal set to 1 when Point Px is not on the defined EC. This flag is updated after execution of the command Check_Point_OnCurve.</description>
	<bitRange>[4:4]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>ECC_Fail_Address</name>
	<description>Address of the last Point detected as Not On Curve, Not Valid or at the infinity.</description>
	<bitRange>[3:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>ECC_VERSION_REG</name>
	<description>Version register</description>
	<addressOffset>0x00000010</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000400</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>ECC_HVN</name>
	<description>Version of IP to be read via CPU interface.</description>
	<bitRange>[15:8]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>ECC_SVN</name>
	<description>Version of Crypto code to be read via CPU interface.Note that this should be read before ECC is used since it corrupts its contents.</description>
	<bitRange>[7:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>FTDF</name>
	<version>1.0</version>
	<description>FTDF registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x40080000</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>73740</size>
	<usage>registers</usage>
</addressBlock>
	
