nguyentri/da-pac/svd/DA14682.svd
	<registers>
	<register>
	<name>FTDF_BUILDTIME_0_REG</name>
	<description>Build time</description>
	<addressOffset>0x00010010</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>BUILDTIME</name>
	<description>A 4 words wide register, showing in ASCII the build date (dd mmm yy) and time (hh:mm) of device, eg. 01 Dec 14 14:10. </description>
	<bitRange>[31:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>FTDF_BUILDTIME_1_REG</name>
	<description>Build time</description>
	<addressOffset>0x00010014</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>BUILDTIME</name>
	<description>A 4 words wide register, showing in ASCII the build date (dd mmm yy) and time (hh:mm) of device, eg. 01 Dec 14 14:10. </description>
	<bitRange>[31:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>FTDF_BUILDTIME_2_REG</name>
	<description>Build time</description>
	<addressOffset>0x00010018</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>BUILDTIME</name>
	<description>A 4 words wide register, showing in ASCII the build date (dd mmm yy) and time (hh:mm) of device, eg. 01 Dec 14 14:10. </description>
	<bitRange>[31:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>FTDF_BUILDTIME_3_REG</name>
	<description>Build time</description>
	<addressOffset>0x0001001c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>BUILDTIME</name>
	<description>A 4 words wide register, showing in ASCII the build date (dd mmm yy) and time (hh:mm) of device, eg. 01 Dec 14 14:10. </description>
	<bitRange>[31:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>FTDF_DEBUGCONTROL_REG</name>
	<description>Debug control register</description>
	<addressOffset>0x00010390</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000100</resetMask>
	<fields><field>
	<name>DBG_RX_INPUT</name>
	<description>If set to '1', the Rx debug interface will be selected as input for the Rx pipeline rather than the DPHY interface signals.
Note that in this mode, DBG_RX_DATA[3:0] and DBG_RX_SOF are sourced by another source (outside the scope of the LMAC) while the other Rx inputs (CCA_STAT, LQI[7:0] and ED_STAT[7:0]) are forced to 0x00. </description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_EVENTCURRVAL_REG</name>
	<description>Value of event generator</description>
	<addressOffset>0x00010058</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x01ffffff</resetMask>
	<fields><field>
	<name>EVENTCURRVAL</name>
	<description>The value of the captured Event generator (Wake-up counter) (initiated by getGeneratorVal, valid when getGeneratorVal_e is set). </description>
	<bitRange>[24:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>FTDF_FTDF_CE_REG</name>
	<description>Selection register events</description>
	<addressOffset>0x00010250</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000003f</resetMask>
	<fields><field>
	<name>FTDF_CE</name>
	<description>Composite service request from ftdf macro (see FR0400 in v40.100.2.41.pdf), set to '1' if the branch currently contributes to the interrupt.
Bit 0 = unused
Bit 1 = rx interrupts
Bit 2 = unused
Bit 3 = miscelaneous interrupts
Bit 4 = tx interrupts
Bit 5 = Reserved
Upon an interrupt, using the ftdf_ce bits it can be checked which interrupt branch creates this interrupt. </description>
	<bitRange>[5:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>FTDF_FTDF_CM_REG</name>
	<description>Mask selection register events</description>
	<addressOffset>0x00010254</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000003f</resetMask>
	<fields><field>
	<name>FTDF_CM</name>
	<description>mask bits for ftf_ce.
The mask bit is masking when cleared to '0' (default value) and will enable the contribution to the interrupt when set to '1'. </description>
	<bitRange>[5:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_GLOB_CONTROL_0_REG</name>
	<description>Global control register</description>
	<addressOffset>0x00010020</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000ff00</resetValue>
	<resetMask>0x0006ff0e</resetMask>
	<fields><field>
	<name>MACTSCHENABLED</name>
	<description>If set to '1', the TSCH mode is enabled </description>
	<bitRange>[18:18]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>MACLEENABLED</name>
	<description>If set to '1', the Low Energy mode (also called CSL) is enabled </description>
	<bitRange>[17:17]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>MACSIMPLEADDRESS</name>
	<description>Simple address of the PAN coordinator </description>
	<bitRange>[15:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TX_DMA_REQ</name>
	<description>Source of the TX_DMA_REQ output pin of this block. </description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RX_DMA_REQ</name>
	<description>Source of the RX_DMA_REQ output pin of this block. </description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ISPANCOORDINATOR</name>
	<description>Enable/disable receiver check on address fields (0=enabled, 1=disabled) </description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_GLOB_CONTROL_1_REG</name>
	<description>Global control register</description>
	<addressOffset>0x00010024</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x7fffffff</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>MACSHORTADDRESS</name>
	<description>The short address of the device. The values 0xFFFF and 0xFFFE indicate that no IEEE Short Address is available. </description>
	<bitRange>[31:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>MACPANID</name>
	<description>The PAN ID of this device.
The value 0xFFFF indicates that the device is not associated to a PAN. </description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_GLOB_CONTROL_2_REG</name>
	<description>Global control register</description>
	<addressOffset>0x00010028</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x7fffffff</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>AEXTENDEDADDRESS_L</name>
	<description>Unique device address, 48 bits wide, lowest 32 bit </description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_GLOB_CONTROL_3_REG</name>
	<description>Global control register</description>
	<addressOffset>0x0001002c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x7fffffff</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>AEXTENDEDADDRESS_H</name>
	<description>Unique device address, 48 bits wide, highest 16 bit </description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_LMACRESET_REG</name>
	<description>Lmax reset register</description>
	<addressOffset>0x00010360</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000106df</resetMask>
	<fields><field>
	<name>LMACGLOBRESET_COUNT</name>
	<description>If set, the LMAC performance and traffic counters will be reset.
Use this register for functionally reset these counters. </description>
	<bitRange>[16:16]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>LMACRESET_TIMCTRL</name>
	<description>LmacReset_count: A '1' resets LMAC timing control block (for debug and MLME-reset) </description>
	<bitRange>[10:10]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>LMACRESET_COUNT</name>
	<description>LmacReset_count: A '1' resets LMAC mac counters (for debug and MLME-reset) </description>
	<bitRange>[9:9]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>LMACRESET_SEC</name>
	<description>LmacReset_sec: A '1' resets LMAC security (for debug and MLME-reset)

