nguyentri/da-pac/svd/DA14682.svd
#$LmacReset_wutim@on_off_regmap
#LmacReset_wutim: A '1' Resets LMAC wake-up timer (for debug and MLME-reset) </description>
	<bitRange>[7:7]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>LMACRESET_TSTIM</name>
	<description>LmacReset_tstim: A '1' resets LMAC timestamp timer (for debug and MLME-reset) </description>
	<bitRange>[6:6]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>LMACRESET_OREG</name>
	<description>LmacReset_oreg: A '1' resets LMAC on_off regmap (for debug and MLME-reset)

#$LmacReset_areg@on_off_regmap
#LmacReset_areg: A '1' Resets LMAC always_on regmap (for debug and MLME-reset) </description>
	<bitRange>[4:4]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>LMACRESET_AHB</name>
	<description>LmacReset_ahb: A '1' resets LMAC ahb interface (for debug and MLME-reset) </description>
	<bitRange>[3:3]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>LMACRESET_TX</name>
	<description>LmacReset_tx: A '1' resets LMAC tx pipeline (for debug and MLME-reset) </description>
	<bitRange>[2:2]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>LMACRESET_RX</name>
	<description>LmacReset_rx: A '1' resets LMAC rx pipeline (for debug and MLME-reset) </description>
	<bitRange>[1:1]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>LMACRESET_CONTROL</name>
	<description>LmacReset_control: A '1' resets LMAC Controller (for debug and MLME-reset) </description>
	<bitRange>[0:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>FTDF_LMAC_CONTROL_0_REG</name>
	<description>Lmac control register</description>
	<addressOffset>0x00010030</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>KEEP_PHY_EN</name>
	<description>When the transmit or receive action is ready (LmacReady4Sleep is set), the PHY_EN signal is cleared unless the control register keep_phy_en is set to '1'.
When the control register keep_phy_en is set to '1', the signal PHY_EN shall remain being set until the keep_phy_en is cleared.
This will help control the behavior of the arbiter between the LMAC and the DPHY. </description>
	<bitRange>[31:31]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PTI_RX</name>
	<description>This value will be used during receiving frames, during the auto ACK (when the AR bit is set in the received frame, see [FR0655] and further), a single CCA and ED scan.
In TSCH mode this register will be used during the time slot in which frames can be received and consequently an Enhanced ACK can be transmitted. </description>
	<bitRange>[30:27]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RXALWAYSON</name>
	<description>If set to '1', the receiver shall be always on if RxEnable is set to '1'. </description>
	<bitRange>[25:25]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RXONDURATION</name>
	<description>The time (in symbol periods) the Rx must be on after setting RxEnable to '1'. </description>
	<bitRange>[24:1]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_LMAC_CONTROL_10_REG</name>
	<description>Lmac control register</description>
	<addressOffset>0x0001010c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x20000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>MACRZZEROVAL</name>
	<description>In CSL mode, if the current RZtime is less or Equal to macRZzeroVal an RZtime with value zero is inserted in the wakeup frame. So this is by default the last Wake-up frame of a Wake-up sequence. </description>
	<bitRange>[31:28]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>MACCSLMARGINRZ</name>
	<description>In CSL mode, the software can set the margin for the expected frame by control register macCSLmarginRZ (in 10 symbol periods).
The LMAC will make sure that the receiver is ready to receive data this amount of time earlier than to be expected by the received RZ time. </description>
	<bitRange>[19:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>MACWURZCORRECTION</name>
	<description>In CSL mode, this register shall be used if the Wake-up frame to be transmitted is larger than 15 octets.
It shall indicate the amount of extra data in a Wake-up frame after the RZ position in the frame (in 10 symbol periods).
This correction is needed to make sure that the correct RZ time is filled in by the LMAC. </description>
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_LMAC_CONTROL_11_REG</name>
	<description>Lmac control register</description>
	<addressOffset>0x0001006c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x7fffffff</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>CSMA_CA_BO_THRESHOLD</name>
	<description>If the backoff time calculated in the CSMA-CA procedure as described in [FR3280] is equal to or higher than the control register Csma_Ca_BO_threshold[8] (resolution 320us, see [FR3290]) the event register Csma_Ca_BO_thr_e will be set and an interrupt.
In case Csma_Ca_BO_threshold equals 0xFF no check will be performed and consequently Csma_Ca_BO_thr_e will not be set and no interrupt will be generated. </description>
	<bitRange>[31:24]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CSMA_CA_NB_VAL</name>
	<description>Number of backoffs value in case of a CSMA-CA resume action. </description>
	<bitRange>[19:17]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>MACDISCARXOFFTORZ</name>
	<description>The switching off and on of the PHY Rx (see macRxTotalCycleTime) can be disabled whith the control register macDisCaRxOfftoRZ.
0 : Disabled
1 : Enabled </description>
	<bitRange>[16:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>MACRXTOTALCYCLETIME</name>
	<description>In CSL mode it can be decided to disable the PHY Rx (Rx-off) after reception of a Wake-up frame and enable the PHY Rx (Rx-on) when the data frame is to be expected, based on the received RZ time.
In order to make it easier to calculate if it is efficient to switch to Rx-off and Rx-on again, a control register indicates the time needed to disable and enable the PHY Rx: macRxTotalCycleTime (resolution is 10 symbol periods) </description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_LMAC_CONTROL_1_REG</name>
	<description>Lmac control register</description>
	<addressOffset>0x00010040</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>PHYRXATTR_HSI</name>
	<description>HighSide injection. </description>
	<bitRange>[15:15]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PHYRXATTR_RF_GPIO_PINS</name>
	<description>Slot-basis signals mapped on GPIO via PPA. </description>
	<bitRange>[14:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PHYRXATTR_CALCAP</name>
	<description>CalCap value. </description>
	<bitRange>[11:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PHYRXATTR_CN</name>
	<description>Channel Number. </description>
	<bitRange>[7:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PHYRXATTR_DEM_LQI</name>
	<description>Select the LQI calculation</description>
	<bitRange>[3:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PHYRXATTR_DEM_CCA</name>
	
