nguyentri/da-pac/svd/DA14682.svd
Note1 that this is a conversion from rx DPHY interface to the internal data byte
So
for(n=7;n&gt;=0;n--)
rx_data(n) = dphy_bit(tx_BitPos(n))
endfor

Note2 that rxBitPos and txBitPos must have inverse functions. </description>
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_PHY_PARAMETERS_1_REG</name>
	<description>Lmac PHY parameter register</description>
	<addressOffset>0x00010184</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x76543210</resetValue>
	<resetMask>0x77777777</resetMask>
	<fields><field>
	<name>TXBITPOS_7</name>
	<description>DPHY interface: see txBitPos_0 </description>
	<bitRange>[30:28]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TXBITPOS_6</name>
	<description>DPHY interface: see txBitPos_0 </description>
	<bitRange>[26:24]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TXBITPOS_5</name>
	<description>DPHY interface: see txBitPos_0 </description>
	<bitRange>[22:20]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TXBITPOS_4</name>
	<description>DPHY interface: see txBitPos_0 </description>
	<bitRange>[18:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TXBITPOS_3</name>
	<description>DPHY interface: see txBitPos_0 </description>
	<bitRange>[14:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TXBITPOS_2</name>
	<description>DPHY interface: see txBitPos_0 </description>
	<bitRange>[10:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TXBITPOS_1</name>
	<description>DPHY interface: see txBitPos_0 </description>
	<bitRange>[6:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TXBITPOS_0</name>
	<description>DPHY interface: control txBitPos(8)(3) controls the position that a bit should have at the DPHY interface.
So the default values are txBitPos_0 = 0, txBitPos_1 = 1, txBitPos_2 = 2, etc.

Note1 that this is a conversion from internal data byte to the DPHY interface.
So
for(n=7;n&gt;=0;n--)
tx_dphy_bit(n) = tx_data(tx_BitPos(n))
endfor

Note2 that txBitPos and rxBitPos must have inverse functions. </description>
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_PHY_PARAMETERS_2_REG</name>
	<description>Lmac PHY parameter register</description>
	<addressOffset>0x00010188</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>PHYTRXWAIT</name>
	<description>DPHY interface: Phy wait time (in us) between deassertion of TX_EN and assertion of RX_EN or vice versa. </description>
	<bitRange>[31:24]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PHYTXFINISH</name>
	<description>DPHY interface: Phy wait time (in us) before deasserting TX_EN after deasserting TX_VALID. </description>
	<bitRange>[23:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PHYTXLATENCY</name>
	<description>DPHY interface: phy delay (in us) between DPHY interface and air interface. </description>
	<bitRange>[15:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PHYTXSTARTUP</name>
	<description>DPHY interface: the phy wait time (in us) before transmission of a frame may start. </description>
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_PHY_PARAMETERS_3_REG</name>
	<description>Lmac PHY parameter register</description>
	<addressOffset>0x0001018c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x01000000</resetValue>
	<resetMask>0x01ffffff</resetMask>
	<fields><field>
	<name>USE_LEGACY_PHY_EN</name>
	<description>If the control register use_legacy_phy_en is set (default), the output signal PHY_TRANSACTION will be sourced by PHY_EN rather than PHY_TRANSACTION. </description>
	<bitRange>[24:24]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PHYENABLE</name>
	<description>DPHY interface: Asserting the DPHY interface signals TX_EN or RX_EN does not take place within the time phyEnable after asserting the signal PHY_EN.
(in us). </description>
	<bitRange>[23:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PHYRXLATENCY</name>
	<description>DPHY interface: Phy delay (in us) between air and DPHY interface. </description>
	<bitRange>[15:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PHYRXSTARTUP</name>
	<description>DPHY interface: Phy wait time (in us) before receiving of a frame may start. </description>
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_REL_NAME_0_REG</name>
	<description>Name of the release</description>
	<addressOffset>0x00010000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>REL_NAME</name>
	<description>A 4 words wide register, showing in ASCII the name of the release, eg. ftdf_107. </description>
	<bitRange>[31:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>FTDF_REL_NAME_1_REG</name>
	<description>Name of the release</description>
	<addressOffset>0x00010004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>REL_NAME</name>
	<description>A 4 words wide register, showing in ASCII the name of the release, eg. ftdf_107. </description>
	<bitRange>[31:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>FTDF_REL_NAME_2_REG</name>
	<description>Name of the release</description>
	<addressOffset>0x00010008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>REL_NAME</name>
	<description>A 4 words wide register, showing in ASCII the name of the release, eg. ftdf_107. </description>
	<bitRange>[31:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>FTDF_REL_NAME_3_REG</name>
	<description>Name of the release</description>
	<addressOffset>0x0001000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>REL_NAME</name>
	<description>A 4 words wide register, showing in ASCII the name of the release, eg. ftdf_107. </description>
	<bitRange>[31:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>FTDF_RX_CONTROL_0_REG</name>
	<description>Receive control register</description>
	<addressOffset>0x00010200</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0fffffff</resetMask>
	<fields><field>
	<name>DISRXACKRECEIVEDCA</name>
	<description>If set to '1', the LMAC controller shall ignore all consequent actions upon a set AR bit in the transmitted frame (e.g. enabling Rx-on mode after the transmission and wait for an ACK). </description>
	<bitRange>[27:27]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>MACIMPLICITBROADCAST</name>
	<description>If set to '1', Frame Version 2 frames without Daddr or DPANId shall be accepted. </description>
	<bitRange>[26:26]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>MACPASSWAKEUP</name>
	<description>In CSL mode, if set to '1', WakeUp frames will be put into the Rx buffer.
This can be useful for software to parse the WakeUp frame. </description>
	<bitRange>[25:25]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>MACALWAYSPASSWAKEUP</name>
	<description>In CSL mode, if the control register macAlwaysPassWakeUp is set to '1', received Wake- up frames for this device are put into the Rx packet buffer without notifying the LMAC Controller (part of transparent mode control). </description>
	<bitRange>[24:24]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>MACALWAYSPASSFRMTYPE</name>
	<description>The control registers macAlwaysPassFrmType[7:0], shall control if this Frame Type shall be dropped.
If a bit is set to '1', the Frame Type corresponding with the bit position is not dropped, even in case of a CRC error.
Example:
if bit 3 is set to '1', Frame Type 3 shall not be dropped.
If there is a FCS error, the error shall be reported in the Rx meta data (crc16_error is set to '1'). </description>
	<bitRange>[23:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>MACALWAYSPASSTOPANCOORDINATOR</name>
	<description>When the control register macAlwaysPassToPanCoordinator is set to '1', the frame is not dropped due to a span_coord_error.
However, in case of an FCS error, the packet is dropped. </description>
	<bitRange>[15:15]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>MACALWAYSPASSBEACONWRONGPANID</name>
	<description>If the control register macAlwaysPassBeaconWrongPANId is set, the frame is not dropped in case of a mismatch in PAN-ID, irrespective of the setting of RxBeaconOnly. </description>
	<bitRange>[14:14]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>MACALWAYSPASSWRONGDADDR</name>
	<description>If set to '1', a packet with a wrong DAddr is not dropped </description>
	<bitRange>[13:13]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>MACALWAYSPASSWRONGDPANID</name>
	<description>If register macAlwaysPassWrongDPANId is set to '1', packet with a wrong Destiantion PanID will not be dropped.
However, in case of an FCS error, the packet is dropped. </description>
	<bitRange>[12:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>MACALWAYSPASSRESFRAMEVERSION</name>
	<description>If set to '1', a packet with a reserved FrameVersion shall not be dropped </description>
	<bitRange>[11:11]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DISDATAREQUESTCA</name>
	<description>When the control register DisDataRequestCa is set, the notification of the received Data Request is disabled. </description>
	<bitRange>[10:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>MACALWAYSPASSCRCERROR</name>
	<description>If set to '1', a FCS error will not drop the frame. However, an FCS error will be reported in the Rx meta data (crc16_error is set to '1'). </description>
	<bitRange>[9:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DISRXACKREQUESTCA</name>
	<description>When the control register DisRxAckRequestca is set to '1' all consequent actions for a received Acknowledge Request bit are disabled. </description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DISRXFRMPENDINGCA</name>
	<description>Whan the control register DisRxFrmPendingCa is set to '1', the notification of the received FP bit to the LMAC Controller is disabled and thus no consequent actions will take place. </description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RX_READ_BUF_PTR</name>
	<description>Indication where new data will be read
All four bits shall be used when using these pointer values (0d - 15d).
However, the Receive Packet buffer has a size of 8 entries.
So reading the Receive Packet buffer entries shall use the mod8 of the pointer values. </description>
	<bitRange>[6:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RXCOORDREALIGNONLY</name>
	<description>If set to '1', only Coordinator Realignment frames are accepted </description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RXBEACONONLY</name>
	<description>If set to '1', only Beacons frames are accepted </description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DBGRXTRANSPARENTMODE</name>
	<description>If set yo '1', Rx pipe is fully set in transparent mode (for debug purpose). </description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_RX_EVENT_REG</name>
	<description>Receive event register</description>
	<addressOffset>0x00010204</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000000f</resetMask>
	<fields><field>
	<name>RXBYTE_E</name>
	<description>If set to '1' it indicates that the first byte of a new packet has been received
This event bit contributes to ftdf_ce[1]. </description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RX_BUF_AVAIL_E</name>
	<description>If set to '1' it indicates that a new valid packet has been completely received
This event bit contributes to ftdf_ce[1]. </description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RX_OVERFLOW_E</name>
	<description>If set to '1' it indicates that the Rx packet buffer has an overflow.
This event bit contributes to ftdf_ce[1]. </description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RXSOF_E</name>
	<description>Set to '1' when RX_SOF has been detected.
This event bit contributes to ftdf_ce[1]. </description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_RX_FIFO_0_0_REG</name>
	<description>Address receive fifo 0</description>
	<addressOffset>0x00008000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>RX_FIFO</name>
	<description>Receive fifo ram, contains 32 addresses per entry (32b x 32a = 128B). There are 8 entries supported. </description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_RX_FIFO_1_0_REG</name>
	<description>Address transmit fifo 1</description>
	<addressOffset>0x00008080</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>RX_FIFO</name>
	<description>Receive fifo ram, contains 32 addresses per entry (32b x 32a = 128B). There are 8 entries supported. </description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_RX_FIFO_2_0_REG</name>
	<description>Address transmit fifo 2</description>
	<addressOffset>0x00008100</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>RX_FIFO</name>
	<description>Receive fifo ram, contains 32 addresses per entry (32b x 32a = 128B). There are 8 entries supported. </description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_RX_FIFO_3_0_REG</name>
	<description>Address transmit fifo 3</description>
	<addressOffset>0x00008180</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>RX_FIFO</name>
	<description>Receive fifo ram, contains 32 addresses per entry (32b x 32a = 128B). There are 8 entries supported. </description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_RX_FIFO_4_0_REG</name>
	<description>Address transmit fifo 4</description>
	<addressOffset>0x00008200</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>RX_FIFO</name>
	<description>Receive fifo ram, contains 32 addresses per entry (32b x 32a = 128B). There are 8 entries supported. </description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_RX_FIFO_5_0_REG</name>
	<description>Address transmit fifo 5</description>
	<addressOffset>0x00008280</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>RX_FIFO</name>
	<description>Receive fifo ram, contains 32 addresses per entry (32b x 32a = 128B). There are 8 entries supported. </description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_RX_FIFO_6_0_REG</name>
	<description>Address transmit fifo 6</description>
	<addressOffset>0x00008300</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>RX_FIFO</name>
	<description>Receive fifo ram, contains 32 addresses per entry (32b x 32a = 128B). There are 8 entries supported. </description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_RX_FIFO_7_0_REG</name>
	<description>Address transmit fifo 7</description>
	<addressOffset>0x00008380</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>RX_FIFO</name>
	<description>Receive fifo ram, contains 32 addresses per entry (32b x 32a = 128B). There are 8 entries supported. </description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_RX_MASK_REG</name>
	<description>Receive event mask register</description>
	<addressOffset>0x00010208</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000000f</resetMask>
	<fields><field>
	<name>RXBYTE_M</name>
	<description>Mask bit for event rxbyte_e.
The mask bit is masking when cleared to '0' (default value) and will enable the contribution to the interrupt when set to '1'. </description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RX_BUF_AVAIL_M</name>
	<description>Mask bit for event rx_buf_avail_e
The mask bit is masking when cleared to '0' (default value) and will enable the contribution to the interrupt when set to '1'. </description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RX_OVERFLOW_M</name>
	<description>Mask bit for event rx_overflow_e
The mask bit is masking when cleared to '0' (default value) and will enable the contribution to the interrupt when set to '1'. </description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RXSOF_M</name>
	<description>Mask bit for event RxSof_e.
The mask bit is masking when cleared to '0' (default value) and will enable the contribution to the interrupt when set to '1'. </description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_RX_META_0_0_REG</name>
	<description>Receive metadata register 0</description>
	<addressOffset>0x00000280</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>RX_TIMESTAMP</name>
	<description>Rx meta data per entry: Timestamp taken when frame was received </description>
	<bitRange>[31:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>FTDF_RX_META_0_1_REG</name>
	<description>Receive metadata register 1</description>
	<addressOffset>0x00000290</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>RX_TIMESTAMP</name>
	<description>Rx meta data per entry: Timestamp taken when frame was received </description>
	<bitRange>[31:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>FTDF_RX_META_0_2_REG</name>
	<description>Receive metadata register 2</description>
	<addressOffset>0x000002a0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>RX_TIMESTAMP</name>
	<description>Rx meta data per entry: Timestamp taken when frame was received </description>
	<bitRange>[31:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>FTDF_RX_META_0_3_REG</name>
	<description>Receive metadata register 3</description>
	<addressOffset>0x000002b0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>RX_TIMESTAMP</name>
	<description>Rx meta data per entry: Timestamp taken when frame was received </description>
	<bitRange>[31:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>FTDF_RX_META_0_4_REG</name>
	<description>Receive metadata register 4</description>
	<addressOffset>0x000002c0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>RX_TIMESTAMP</name>
	<description>Rx meta data per entry: Timestamp taken when frame was received </description>
	<bitRange>[31:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>FTDF_RX_META_0_5_REG</name>
	<description>Receive metadata register 5</description>
	<addressOffset>0x000002d0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>RX_TIMESTAMP</name>
	<description>Rx meta data per entry: Timestamp taken when frame was received </description>
	<bitRange>[31:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>FTDF_RX_META_0_6_REG</name>
	<description>Receive metadata register 6</description>
	<addressOffset>0x000002e0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>RX_TIMESTAMP</name>
	<description>Rx meta data per entry: Timestamp taken when frame was received </description>
	<bitRange>[31:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>FTDF_RX_META_0_7_REG</name>
	<description>Receive metadata register 7</description>
	<addressOffset>0x000002f0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>RX_TIMESTAMP</name>
	<description>Rx meta data per entry: Timestamp taken when frame was received </description>
	<bitRange>[31:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>FTDF_RX_META_1_0_REG</name>
	<description>Receive metadata register 0</description>
	<addressOffset>0x00000284</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000fffd</resetMask>
	<fields><field>
	<name>QUALITY_INDICATOR</name>
	<description>Rx meta data per entry: the Link Quality Indication value during reception of this frame.

