nguyentri/da-pac/svd/DA14682.svd
	<addressOffset>0x00012008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000001f</resetMask>
	<fields><field>
	<name>SHORT_LONGNOT</name>
	<description>A '1' indicates that Exp_SA contains four short SA's, a '0' indicates one long SA. </description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VALID_SA</name>
	<description>Indication which SA entry is valid (if set). In case of 4 short SA Valid bit 3 belongs to SA entry 3 etc.
In case of a long SA Valid bit 0 is the valid indication. </description>
	<bitRange>[3:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_SYMBOLTIME2THR_REG</name>
	<description>Symboltime threshold register 2</description>
	<addressOffset>0x00010384</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>SYMBOLTIME2THR</name>
	<description>Symboltime 2 Threshold to generate a general interrupt when this value matches the symbol counter value. </description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_SYMBOLTIMESNAPSHOTVAL_REG</name>
	<description>Value timestamp generator</description>
	<addressOffset>0x00010210</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>SYMBOLTIMESNAPSHOTVAL</name>
	<description>The Status register SymbolTimeSnapshotVal indicates the actual value of the TimeStamp generator.
This can be useful for software to use e.g. in CSL mode at creating an Enhanced ACK to calculate the CSL phase and period. </description>
	<bitRange>[31:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>FTDF_SYMBOLTIMETHR_REG</name>
	<description>Symboltime threshold register 1</description>
	<addressOffset>0x00010380</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>SYMBOLTIMETHR</name>
	<description>Symboltime Threshold to generate a general interrupt when this value matches the symbol counter value. </description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_SYNCTIMESTAMPPHASEVAL_REG</name>
	<description>Timestamp phase value regsiter</description>
	<addressOffset>0x00010320</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields><field>
	<name>SYNCTIMESTAMPPHASEVAL</name>
	<description>Value to synchronize the timestamp counter phase with at the moment indicated by SyncTimeStampThr.
Please note the +1 correction needed for most accurate result (+0.5 is than the average error, resulting is a just too fast clock). </description>
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_SYNCTIMESTAMPTHR_REG</name>
	<description>Threshold timestamp generator</description>
	<addressOffset>0x00010304</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x01ffffff</resetMask>
	<fields><field>
	<name>SYNCTIMESTAMPTHR</name>
	<description>Threshold for synchronize the timestamp counter: at this value of the event counter the synchronization of the timestamp (symbol) counter is done (if SyncTimeStampEna is set to '1').
If SyncTimeStamp_e is set to '1' the synchronization has taken place. </description>
	<bitRange>[24:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_SYNCTIMESTAMPVAL_REG</name>
	<description>Value timestamp generator</description>
	<addressOffset>0x00010308</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>SYNCTIMESTAMPVAL</name>
	<description>Value to synchronize the timestamp counter with at the moment indicated by SyncTimeStampThr. </description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_TIMER_CONTROL_1_REG</name>
	<description>Timer control register</description>
	<addressOffset>0x0001030c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000002</resetMask>
	<fields><field>
	<name>SYNCTIMESTAMPENA</name>
	<description>If set to '1', the synchronization of the timestamp counter after a deep-sleep cycle will be performed when SyncTimeStampThr matches the value of the event (wake-up) counter. </description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_TIMESTAMPCURRPHASEVAL_REG</name>
	<description>Value of timestamp generator phase within a symbol</description>
	<addressOffset>0x00010074</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields><field>
	<name>TIMESTAMPCURRPHASEVAL</name>
	<description>Value of captured timestamp generator phase within a symbol (initiated by getGeneratorVal, valid when getGeneratorVal_e is set) </description>
	<bitRange>[7:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>FTDF_TIMESTAMPCURRVAL_REG</name>
	<description>Value of timestamp generator</description>
	<addressOffset>0x0001005c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>TIMESTAMPCURRVAL</name>
	<description>The value of captured timestamp generator (symbol counter) (initiated by getGeneratorVal, valid when getGeneratorVal_e is set) </description>
	<bitRange>[31:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>FTDF_TSCH_CONTROL_0_REG</name>
	<description>Lmac tsch control register</description>
	<addressOffset>0x00010160</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x089803e8</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>MACTSRXWAIT</name>
	<description>TSCH mode: The times to wait for start of frame </description>
	<bitRange>[31:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>MACTSTXACKDELAY</name>
	<description>TSCH mode: the time between the end of a Rx frame and the start of an Enhanced Acknowlegde frame. </description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_TSCH_CONTROL_1_REG</name>
	<description>Lmac tsch control register</description>
	<addressOffset>0x00010164</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x000000c0</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>MACTSRXTX</name>
	<description>TSCH mode: The time between the CCA and the TX of a frame </description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_TSCH_CONTROL_2_REG</name>
	<description>Lmac tsch control register</description>
	<addressOffset>0x00010168</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x01900320</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>MACTSACKWAIT</name>
	<description>TSCH mode: The minimum time to wait for start of an Acknowledgement </description>
	<bitRange>[31:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>MACTSRXACKDELAY</name>
	<description>TSCH mode: End of frame to when the transmitter shall listen for Acknowledgement </description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_TXBYTE_E_REG</name>
	<description>Transmit first byte register</description>
	<addressOffset>0x00010394</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000003</resetMask>
	<fields><field>
	<name>TX_LAST_SYMBOL_E</name>
	<description>If set to '1', it indicates the last symbol of a frame is transmitted
This event bit contributes to ftdf_ce[4]. </description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TXBYTE_E</name>
	<description>If set to '1', it indicates the first byte of a frame is transmitted
This event bit contributes to ftdf_ce[4]. </description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_TXBYTE_M_REG</name>
	<description>Transmit first byte mask register</description>
	<addressOffset>0x00010398</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000003</resetMask>
	<fields><field>
	<name>TX_LAST_SYMBOL_M</name>
	<description>Mask bit for event tx_last_symbol_e.
The mask bit is masking when cleared to '0' (default value) and will enable the contribution to the interrupt when set to '1'. </description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TXBYTE_M</name>
	<description>Mask bit for event txbyte_e.
The mask bit is masking when cleared to '0' (default value) and will enable the contribution to the interrupt when set to '1'. </description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_TXPIPEPROPDELAY_REG</name>
	<description>Prop delay transmit register</description>
	<addressOffset>0x00010034</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields><field>
	<name>TXPIPEPROPDELAY</name>
	<description>Propagation delay (in us) of the tx pipe, between start of transmission (indicated by setting tx_flag_status) to the DPHY.
The reset value is 0 us, which is also the closest value to the real implementation figure. </description>
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_TX_CLEAR_OS_REG</name>
	<description>One shot register to clear flag</description>
	<addressOffset>0x00010484</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000000f</resetMask>
	<fields><field>
	<name>TX_FLAG_CLEAR</name>
	<description>Tx meta data per entry: if set to '1', the tx_flag_stat will be cleared to '0'. </description>
	<bitRange>[3:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>FTDF_TX_CONTROL_0_REG</name>
	<description>Transmit control register</description>
	<addressOffset>0x00010240</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00004350</resetValue>
	<resetMask>0x00007ff1</resetMask>
	<fields><field>
	<name>MACMAXCSMABACKOFFS</name>
	<description>CSMA-CA: Maximum number of CSMA-CA backoffs (range 0-5) </description>
	<bitRange>[14:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>MACMINBE</name>
	<description>CSMA-CA: Minimum Backoff Exponent (range 0-macMaxBE) </description>
	<bitRange>[11:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>MACMAXBE</name>
	<description>CSMA-CA: Maximum Backoff Exponent (range 3-8) </description>
	<bitRange>[7:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DBGTXTRANSPARENTMODE</name>
	<description>If set to '1', the MPDU octets pass transparently through the MAC in the transmit direction (for debug purpose). </description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_TX_FIFO_0_0_REG</name>
	<description>Address transmit fifo 0</description>
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>TX_FIFO</name>
	<description>Transmit fifo buffer, contains 32 addresses per entry (32b x 32a = 128B). There are 4 entries supported.
Note that, despite the name, this fifo is NOT retained when the LMAC is put into deep-sleep! </description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_TX_FIFO_1_0_REG</name>
	<description>Address transmit fifo 1</description>
	<addressOffset>0x00000080</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>TX_FIFO</name>
	<description>Transmit fifo buffer, contains 32 addresses per entry (32b x 32a = 128B). There are 4 entries supported.
Note that, despite the name, this fifo is NOT retained when the LMAC is put into deep-sleep! </description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_TX_FIFO_2_0_REG</name>
	<description>Address transmit fifo 2</description>
	<addressOffset>0x00000100</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>TX_FIFO</name>
	<description>Transmit fifo buffer, contains 32 addresses per entry (32b x 32a = 128B). There are 4 entries supported.
Note that, despite the name, this fifo is NOT retained when the LMAC is put into deep-sleep! </description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_TX_FIFO_3_0_REG</name>
	<description>Address transmit fifo 3</description>
	<addressOffset>0x00000180</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>TX_FIFO</name>
	<description>Transmit fifo buffer, contains 32 addresses per entry (32b x 32a = 128B). There are 4 entries supported.
Note that, despite the name, this fifo is NOT retained when the LMAC is put into deep-sleep! </description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_TX_FLAG_CLEAR_E_0_REG</name>
	<description>Clear flag register 0</description>
	<addressOffset>0x00010404</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields><field>
	<name>TX_FLAG_CLEAR_E</name>
	<description>Tx meta data per entry: if set to '1' the LMAC hardware has cleared the tx_flag_stat status.
This event bit contributes to ftdf_ce[4]. </description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_TX_FLAG_CLEAR_E_1_REG</name>
	<description>Clear flag register 1</description>
	<addressOffset>0x00010424</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields><field>
	<name>TX_FLAG_CLEAR_E</name>
	<description>Tx meta data per entry: if set to '1' the LMAC hardware has cleared the tx_flag_stat status.
This event bit contributes to ftdf_ce[4]. </description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_TX_FLAG_CLEAR_E_2_REG</name>
	<description>Clear flag register 2</description>
	<addressOffset>0x00010444</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields><field>
	<name>TX_FLAG_CLEAR_E</name>
	<description>Tx meta data per entry: if set to '1' the LMAC hardware has cleared the tx_flag_stat status.
This event bit contributes to ftdf_ce[4]. </description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_TX_FLAG_CLEAR_E_3_REG</name>
	<description>Clear flag register 3</description>
	<addressOffset>0x00010464</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields><field>
	<name>TX_FLAG_CLEAR_E</name>
	<description>Tx meta data per entry: if set to '1' the LMAC hardware has cleared the tx_flag_stat status.
This event bit contributes to ftdf_ce[4]. </description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_TX_FLAG_CLEAR_M_0_REG</name>
	<description>Mask flag register 0</description>
	<addressOffset>0x00010408</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields><field>
	<name>TX_FLAG_CLEAR_M</name>
	<description>Tx meta data per entry: Mask bit for event tx_flag_clear_e.
The mask bit is masking when cleared to '0' (default value) and will enable the contribution to the interrupt when set to '1'. </description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_TX_FLAG_CLEAR_M_1_REG</name>
	<description>Mask flag register 1</description>
	<addressOffset>0x00010428</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields><field>
	<name>TX_FLAG_CLEAR_M</name>
	<description>Tx meta data per entry: Mask bit for event tx_flag_clear_e
The mask bit is masking when cleared to '0' (default value) and will enable the contribution to the interrupt when set to '1'. </description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_TX_FLAG_CLEAR_M_2_REG</name>
	<description>Clear flag register 2</description>
	<addressOffset>0x00010448</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields><field>
	<name>TX_FLAG_CLEAR_M</name>
	<description>Tx meta data per entry: Mask bit for event tx_flag_clear_e
The mask bit is masking when cleared to '0' (default value) and will enable the contribution to the interrupt when set to '1'. </description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_TX_FLAG_CLEAR_M_3_REG</name>
	<description>Clear flag register 3</description>
	<addressOffset>0x00010468</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields><field>
	<name>TX_FLAG_CLEAR_M</name>
	<description>Tx meta data per entry: Mask bit for event tx_flag_clear_e
The mask bit is masking when cleared to '0' (default value) and will enable the contribution to the interrupt when set to '1'. </description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_TX_FLAG_S_0_REG</name>
	<description>Transmit packet ready for transmission register 0</description>
	<addressOffset>0x00010400</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields><field>
	<name>TX_FLAG_STAT</name>
	<description>Tx meta data per entry: if set to '1', the packet is ready for transmission </description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>FTDF_TX_FLAG_S_1_REG</name>
	<description>Transmit packet ready for transmission register 1</description>
	<addressOffset>0x00010420</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields><field>
	<name>TX_FLAG_STAT</name>
	<description>Tx meta data per entry: if set to '1', the packet is ready for transmission </description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>FTDF_TX_FLAG_S_2_REG</name>
	<description>Transmit packet ready for transmission register 2</description>
	<addressOffset>0x00010440</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields><field>
	<name>TX_FLAG_STAT</name>
	<description>Tx meta data per entry: if set to '1', the packet is ready for transmission </description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>FTDF_TX_FLAG_S_3_REG</name>
	<description>Transmit packet ready for transmission register 3</description>
	<addressOffset>0x00010460</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields><field>
	<name>TX_FLAG_STAT</name>
	<description>Tx meta data per entry: if set to '1', the packet is ready for transmission </description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>FTDF_TX_META_DATA_0_0_REG</name>
	<description>Transmit metadata register 0</description>
	<addressOffset>0x00000200</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x57ffffff</resetMask>
	<fields><field>
	<name>CRC16_ENA</name>
	<description>Tx meta data per entry: Indicates whether CRC16 insertion must be enabled or not.
0 : No hardware inserted CRC16
1 : Hardware inserts CRC16 </description>
	<bitRange>[30:30]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ACKREQUEST</name>
	<description>Tx meta data per entry: '1' indicates that an acknowledge is expected from the recipient of this packet. </description>
	<bitRange>[28:28]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CSMACA_ENA</name>
	<description>Tx meta data per entry: '1' indicates that a CSMA-CA is required for the transmission of this packet. </description>
	<bitRange>[26:26]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FRAMETYPE</name>
	<description>Tx meta data per entry: the frame type of the data to be transmitted (Data/Cmd/Ack/wakeup frame/etc.). </description>
	<bitRange>[25:23]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PHYATTR_HSI</name>
	<description>HighSide injection. </description>
	<bitRange>[22:22]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PHYATTR_RF_GPIO_PINS</name>
	<description>Slot-basis signals mapped on GPIO via PPA. </description>
	<bitRange>[21:19]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PHYATTR_CALCAP</name>
	<description>CalCap value. </description>
	<bitRange>[18:15]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PHYATTR_CN</name>
	<description>Channel Number. </description>
	<bitRange>[14:11]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PHYATTR_DEM_PTI</name>
	<description>DEM packet information. </description>
	<bitRange>[10:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FRAME_LENGTH</name>
	<description>Tx meta data per entry: Frame length (in bytes) </description>
	<bitRange>[6:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_TX_META_DATA_0_1_REG</name>
	<description>Transmit metadata register 1</description>
	<addressOffset>0x00000210</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x57ffffff</resetMask>
	<fields><field>
	<name>CRC16_ENA</name>
	<description>Tx meta data per entry: Indicates whether CRC16 insertion must be enabled or not.
0 : No hardware inserted CRC16
1 : Hardware inserts CRC16 </description>
	<bitRange>[30:30]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ACKREQUEST</name>
